In [1]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [2]:
#To print out each high school using a for loop, use the following code:

for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [3]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [4]:
#Iterate through the list of dictionaries and print out each high school and their types

for school in high_school_types:
    print(school)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [5]:
#A one-dimensional array is a list of objects.
#convert the list of high schools in Jupyter Notebook to a Pandas Series,
#To create a Pandas Series, we'll use the pandas.Series() method from the Pandas library. 
#But in order to use this method, we first need to import the Pandas library as a dependency.
# Add the Pandas dependency.
import pandas as pd
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [7]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [13]:
#Iterate through the school_series and print out each high school.

In [12]:
#We can convert the data in this Excel file to a 
#Pandas DataFrame using the pandas.DataFrame() method from the Pandas library.
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]
#we will convert the array, or list of dictionaries, to a DataFrame using school_df = pd.DataFrame(high_school_dicts)
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [15]:
#We can also create the same DataFrame by adding each column as a list, or Series, to an empty DataFrame.

# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [17]:
#Next, in a new cell, initialize an empty DataFrame, like this:

# Initialize a new DataFrame.
schools_df = pd.DataFrame()

#Now we will add each list to the empty schools_df DataFrame by typing the column name in quotes within brackets, 
#like we do when we create a key for a dictionary.

#The standard format for creating a key in a dictionary is to 
#put the key in single or double quotes and inside brackets, e.g.,  
#counties_dict["Arapahoe"] = 422829.

#Instead of using the dictionary name, 
#we'll use the name of the DataFrame and make it equal to the list, like this:

# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Print the DataFrame.
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [20]:
#Add the school_name list as "School Name" and the type_of_school list as "Type" to the schools_df DataFrame. 
#Then print out the schools_df DataFrame.

#Another way to create this DataFrame is to create a Python dictionary
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [23]:
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4